#include<stdio.h>
int char_to_ascii()
{
    char x;
    scanf("%c",&x);
    if (x>='a' && x<='z' || 
        x>='A' && x<='Z' || x>='0' && x<='9')
    {
        return x;
    }
    else
    {
        return -1;
    }
      
}
int main()
{  
    if (char_to_ascii()!=-1)
    {
        printf("%d",char_to_ascii());
    }
     
   
    return 0;
}
// #include<stdio.h>
// int sum()       // sum ফাংশন ডিক্লেয়ার করা হয়েছে। যা দুটি সংখ্যার যোগফল রিটার্ন করবে 
//তাই রিটার্ন টাইপ int। কোন প্যারামিটার নেওয়া হচ্ছে না, তাই প্যারামিটারের অংশটুকু খালি রাখা হয়েছে। 
// {
//   int a,b;      
//   scanf("%d %d",&a,&b); // যেহেতু প্যারামিটার নেওয়া হচ্ছে না, তাই এই ফাংশনের ভিতরেই ইউজার থেকে ইনপুট নেওয়া হচ্ছে। 
//   int s=a+b;    // ইনপুট নেওয়া সংখ্যা দুটি যোগ করে স্টোর করে রাখা হচ্ছে। 
//   return s;     // যোগফল রিটার্ন করা হচ্ছে।
// }
// int main()
// {
//   int s=sum();    // যেহেতু ফাংশনে কোন প্যারামিটার দেওয়া যাবে না তাই মেইন ফাংশনে ইউজার 
// থেকে ইনপুট নেওয়া হয় নি। সরাসরি ফাংশনকে কল করে দেওয়া হয়েছে কোন প্যারামিটার না দিয়ে এবং ফাংশন যা রিটার্ন করছে তা স্টোর করে রাখা হচ্ছে। 
//   printf("%d",s);  // স্টোর করে রাখা ফাংশন থেকে রিটার্ন হয়ে আসা যোগফল প্রিন্ট করা হচ্ছে।
//   return 0;
// }